wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/cherryusb/usb_hs_dc.c
#include <stdint.h>
#include "NuMicro.h"
#include "usbd_core.h"
#include "nu_bitutil.h"

#define EPADR_SW2HW(address)    ((address == 0) ? (CEP) : (USB_EP_GET_IDX(address) - 1))
#define EPADR_HW2SW(address)    (address + 1)
#define CEP_BUF_ADR             0
#define CEP_BUF_SIZE            64

/* Endpoint state */
struct usb_dc_ep_state
{
    uint16_t ep_mps;     /* Endpoint max packet size */
    uint8_t  ep_type;    /* Endpoint type */
    uint8_t  ep_stalled; /* Endpoint stall flag */
    uint8_t  ep_enable;  /* Endpoint enable */
    uint8_t  ep_addr;    /* Endpoint address */
    uint8_t *xfer_buf;
    uint32_t xfer_len;
    uint32_t actual_xfer_len;
    uint32_t mps_xfer_len;
};

/* Driver state */
struct usb_dc_config_priv
{
    struct usb_setup_packet setup_pkt;
    uint32_t epUsedBufSize;
    struct usb_dc_ep_state ep[HSUSBD_MAX_EP]; /*!< IN/OUT endpoint parameters*/
} ;

/* Private Variables ------------------------------------------------------------*/
static volatile struct usb_dc_config_priv s_sUDC;

static const char *szGLOBAL[] =
{
    "USBIF",
    "CEPIF"
};

static const char *szUSBIF[] =
{
    "SOFIF",
    "RSTIF",
    "RESUMEIF",
    "SUSPENDIF",
    "HISPDIF",
    "DMADONEIF",
    "PHYCLKVLDIF",
    "BIT7-RESERVED",
    "VBUSDETIF",
    "BIT9-RESERVED"
};

static const char *szCEPIF[] =
{
    "SETUPTKIF",
    "SETUPPKIF",
    "OUTTKIF",
    "INTKIF",
    "PINGIF",
    "TXPKIF",
    "RXPKIF",
    "NAKIF",
    "STALLIF",
    "ERRIF",
    "STSDONEIF",
    "BUFFULLIF",
    "BUFEMPTYIF",
    "BIT9-RESERVED"
};



__STATIC_INLINE uint32_t HSUSBD_GetEpBufAddr(uint32_t u32HWEP)
{
    if (u32HWEP == CEP)
    {
        return HSUSBD->CEPBUFSTART;
    }

    return HSUSBD->EP[u32HWEP].EPBUFSTART;
}

__STATIC_INLINE uint32_t HSUSBD_GetEpBufAddrEnd(uint32_t u32HWEP)
{
    if (u32HWEP == CEP)
    {
        return HSUSBD->CEPBUFEND;
    }

    return HSUSBD->EP[u32HWEP].EPBUFEND;
}

__STATIC_INLINE uint32_t HSUSBD_GetEpDir(uint32_t u32HWEP)
{
    return HSUSBD->EP[u32HWEP].EPCFG & HSUSBD_EPCFG_EPDIR_Msk;
}

static void HSUSBD_DumpEpBufAddr(void)
{
    int i;

    USB_LOG_INFO("CEP@[%08X-%08X]\n", HSUSBD_GetEpBufAddr(CEP), HSUSBD_GetEpBufAddrEnd(CEP));
    for (i = 0; i < HSUSBD_MAX_EP; i++)
    {
        USB_LOG_INFO("EP%c@[%08X-%08X]\n", 'A' + i, HSUSBD_GetEpBufAddr(EPA + i), HSUSBD_GetEpBufAddrEnd(EPA + i));
    }
}

static uint32_t HSUSBD_NewEpBuf(int n)
{
#define DEF_HSUSBD_RAM_SIZE            8192
#define DEF_HSUSBD_MAX_EP_BUF_SIZE     1024

    uint32_t u32Addr;

    if (((s_sUDC.epUsedBufSize + n) > DEF_HSUSBD_RAM_SIZE) || (n > DEF_HSUSBD_MAX_EP_BUF_SIZE))
        return 0;

    u32Addr = s_sUDC.epUsedBufSize;
    s_sUDC.epUsedBufSize += n;

    return u32Addr;
}

__WEAK void usb_dc_low_level_init(void)
{
}

__WEAK void usb_dc_low_level_deinit(void)
{
}

int usb_dc_init(uint8_t busid)
{
    int i;
    int32_t i32TimeOutCnt = HSUSBD_TIMEOUT/1000;

    rt_kprintf("%s %d\n", __func__, __LINE__);

    memset((void *)&s_sUDC, 0, sizeof(s_sUDC));
    s_sUDC.epUsedBufSize = CEP_BUF_SIZE;

    rt_kprintf("%s %d\n", __func__, __LINE__);

    usb_dc_low_level_init();

    rt_kprintf("%s %d\n", __func__, __LINE__);

    /*****************************************************/
    /* Initial USB engine */
    HSUSBD_ENABLE_PHY();
    /* wait PHY clock ready */
    while (!(HSUSBD->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
    {
        rt_kprintf("%s %d %d\n", __func__, __LINE__, i32TimeOutCnt);
        if (i32TimeOutCnt-- < 0)
        {
            break;
        }
    }
    rt_kprintf("%s %d\n", __func__, __LINE__);

    HSUSBD->OPER &= ~HSUSBD_OPER_HISPDEN_Msk;   /* full-speed */

    /* Force SE0 */
    HSUSBD_SET_SE0();

    /* Configure USB controller */
    /* Enable USB BUS, CEP global interrupt */
    HSUSBD_ENABLE_USB_INT(HSUSBD_GINTEN_USBIEN_Msk
                          | HSUSBD_GINTEN_CEPIEN_Msk);


    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RESUMEIEN_Msk
                          | HSUSBD_BUSINTEN_RSTIEN_Msk
                          | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    /* USB start */
    HSUSBD_CLR_SE0();

    /* Enable interrupt */
    NVIC_EnableIRQ(HSUSBD_IRQn);

    HSUSBD_ENABLE_USB();

    return 0;
}

int usb_dc_deinit(uint8_t busid)
{
    HSUSBD_SET_ADDR(0);

    /* Force SE0 */
    HSUSBD_SET_SE0();

    HSUSBD_DISABLE_USB();

    /* Enable interrupt */
    NVIC_DisableIRQ(HSUSBD_IRQn);

    usb_dc_low_level_deinit();

    return 0;
}

static uint8_t g_address = 0;
int usbd_set_address(uint8_t busid, const uint8_t addr)
{
    USB_LOG_DBG("[%s]%d\n", __func__, addr);
    g_address = addr;

    return 0;
}

uint8_t usbd_get_port_speed(uint8_t busid)
{
    if (HSUSBD->OPER & HSUSBD_OPER_CURSPD_Msk)
    {
        USB_LOG_DBG("[%s] HIGH\r\n", __func__);
        return USB_SPEED_HIGH;
    }

    USB_LOG_DBG("[%s] FULL\r\n", __func__);
    return USB_SPEED_FULL;
}

int usbd_ep_open(uint8_t busid, const struct usb_endpoint_descriptor *ep)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep->bEndpointAddress);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    uint32_t u32MPS = USB_GET_MAXPACKETSIZE(ep->wMaxPacketSize);

    if (SWEP)  // IN/OUT EPs
    {
        uint32_t u32EPType = USB_GET_ENDPOINT_TYPE(ep->bmAttributes);
        uint32_t u32HWEPType;

        switch (u32EPType)
        {
        case USB_ENDPOINT_TYPE_ISOCHRONOUS:
            u32HWEPType = HSUSBD_EP_CFG_TYPE_ISO;
            break;
        case USB_ENDPOINT_TYPE_BULK:
            u32HWEPType = HSUSBD_EP_CFG_TYPE_BULK;
            break;
        case USB_ENDPOINT_TYPE_INTERRUPT:
            u32HWEPType = HSUSBD_EP_CFG_TYPE_INT;
            break;
        default:
            return -1;
        }

        s_sUDC.ep[HWEP].ep_addr = ep->bEndpointAddress;
        s_sUDC.ep[HWEP].ep_mps = u32MPS;
        s_sUDC.ep[HWEP].ep_type = u32EPType;
        s_sUDC.ep[HWEP].ep_enable = true;

        HSUSBD_SetEpBufAddr(HWEP, HSUSBD_NewEpBuf(u32MPS), u32MPS);
        HSUSBD_SET_MAX_PAYLOAD(HWEP, u32MPS);

        if (USB_EP_DIR_IS_IN(ep->bEndpointAddress)) // IN
        {
            HSUSBD_ENABLE_EP_INT(HWEP, HSUSBD_EPINTEN_TXPKIEN_Msk);
            HSUSBD_ConfigEp(HWEP, SWEP, u32HWEPType, HSUSBD_EP_CFG_DIR_IN);
        }
        else //OUT
        {
            HSUSBD_ENABLE_EP_INT(HWEP, HSUSBD_EPINTEN_RXPKIEN_Msk | HSUSBD_EPINTEN_SHORTRXIEN_Msk | HSUSBD_EPINTEN_BUFFULLIEN_Msk);
            HSUSBD_ConfigEp(HWEP, SWEP, u32HWEPType, HSUSBD_EP_CFG_DIR_OUT);
        }

        HSUSBD->EP[HWEP].EPRSPCTL = (HSUSBD->EP[HWEP].EPRSPCTL & HSUSBD_EP_RSPCTL_MODE_MASK) | HSUSBD_EPRSPCTL_FLUSH_Msk;

        HSUSBD->GINTEN |= (0x1UL << (HSUSBD_GINTEN_EPAIEN_Pos + (HWEP - EPA)));

        USB_LOG_INFO("[%s]EpAddr:%02x-> SWEP:%d -> EP%c_Buf@[%08x - %08X], HWEPType:%08x\n",
                     __func__,
                     s_sUDC.ep[HWEP].ep_addr,
                     SWEP,
                     'A' + HWEP,
                     HSUSBD_GetEpBufAddr(HWEP), HSUSBD_GetEpBufAddrEnd(HWEP),
                     u32HWEPType);

        //HSUSBD_DumpEpBufAddr();

