wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/cherryusb/usb_hs_dc.c
    }
    else if (ep->bEndpointAddress == USB_CONTROL_IN_EP0)
    {
        USB_LOG_INFO("[%s]EP:%02x, SWEP:%02x, CEP, MaxPktSize: %d\n", __func__, ep->bEndpointAddress, SWEP, u32MPS);

        /* Control endpoint */
        HSUSBD_SetEpBufAddr(CEP, CEP_BUF_ADR, CEP_BUF_SIZE);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk
                              | HSUSBD_CEPINTEN_STSDONEIEN_Msk
                              | HSUSBD_CEPINTEN_TXPKIEN_Msk
                              | HSUSBD_CEPINTEN_RXPKIEN_Msk);
        HSUSBD_SET_ADDR(0);

        /* Clear all CEP-BUFEMPTYIF, BUFFULLIF, STSDONEIF, ERRIF, STALLIF, NAKIF, RXPKIF, TXPKIF,
        PINGIF, INTKIF, OUTTKIF flags, unless SETUPPKIF and SETUPTKIF flags. */
        HSUSBD_CLR_CEP_INT_FLAG(0x1ffc);
    }

    return 0;
}

int usbd_ep_close(uint8_t busid, const uint8_t ep)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    if (USB_EP_GET_IDX(ep))  // IN/OUT EPs
    {
        USB_LOG_DBG("[%s]EP:%02x-> SWEP:%d -> EP%c\n", __func__, ep, SWEP, 'A' + HWEP);
        HSUSBD->EP[HWEP].EPCFG &= ~HSUSBD_EP_CFG_VALID;
    }
    else //CEP
    {
        USB_LOG_DBG("[%s]EP:%02x-> SWEP:%d -> CEP\n", __func__, ep, SWEP);
    }

    return 0;
}

int usbd_ep_set_stall(uint8_t busid, const uint8_t ep)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    HSUSBD_SetEpStall(HWEP);

    return 0;
}

int usbd_ep_clear_stall(uint8_t busid, const uint8_t ep)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    HSUSBD_ClearEpStall(HWEP);

    return 0;
}

int usbd_ep_is_stalled(uint8_t busid, const uint8_t ep, uint8_t *stalled)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    *stalled = HSUSBD_GetEpStall(HWEP) > 0 ? 1 : 0;

    return 0;
}

static uint32_t usbd_ep_xfer(const uint8_t ep_addr, uint8_t *buffer, uint32_t size)
{
    uint32_t i, cnt;
    uint32_t *_buf_word;
    uint8_t  *_buf_byte;
    uint8_t SWEP = USB_EP_GET_IDX(ep_addr);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    _buf_word = (uint32_t *)buffer;
    cnt = size >> 2;
    _buf_byte = (uint8_t *)((uint8_t *)buffer + (cnt * 4));

    if (SWEP) //EPs
    {
        if (USB_EP_DIR_IS_IN(ep_addr)) //IN
        {
            for (i = 0; i < cnt; i++)
            {
                HSUSBD->EP[HWEP].EPDAT = _buf_word[i];
            }
            for (i = 0; i < (size & 0x3); i++)
            {
                HSUSBD->EP[HWEP].EPDAT_BYTE = _buf_byte[i];
            }

            HSUSBD->EP[HWEP].EPRSPCTL = HSUSBD_EP_RSPCTL_SHORTTXEN; // packet end
            HSUSBD->EP[HWEP].EPTXCNT = size;
        }
        else //OUT
        {
            for (i = 0; i < cnt; i++)
            {
                _buf_word[i] = HSUSBD->EP[HWEP].EPDAT;
            }
            for (i = 0; i < (size & 0x3); i++)
            {
                _buf_byte[i] = HSUSBD->EP[HWEP].EPDAT_BYTE;
            }
        }
    }
    else //CEP
    {
        if (USB_EP_DIR_IS_IN(ep_addr)) //IN
        {
            for (i = 0; i < cnt; i++)
            {
                HSUSBD->CEPDAT = _buf_word[i];
            }
            for (i = 0; i < (size & 0x3); i++)
            {
                HSUSBD->CEPDAT_BYTE = _buf_byte[i];
            }
        }
        else //OUT
        {
            for (i = 0; i < cnt; i++)
            {
                _buf_word[i] = HSUSBD->CEPDAT;
            }
            for (i = 0; i < (size & 0x3); i++)
            {
                _buf_byte[i] = HSUSBD->CEPDAT_BYTE;
            }
        }
    }

    return size;
}

int usbd_ep_start_write(uint8_t busid, const uint8_t ep, const uint8_t *data, uint32_t data_len)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    USB_LOG_DBG("[W] ep:%02x, %p, len: %d\n", ep, data, data_len);

    if (SWEP)  // IN EPs
    {
        if (!data && data_len)
        {
            return -1;
        }

        if (!s_sUDC.ep[HWEP].ep_enable)
        {
            return -2;
        }

        s_sUDC.ep[HWEP].xfer_buf = (uint8_t *)data;
        s_sUDC.ep[HWEP].xfer_len = data_len;
        s_sUDC.ep[HWEP].actual_xfer_len = 0;

        if (data_len > s_sUDC.ep[HWEP].ep_mps)
        {
            data_len = s_sUDC.ep[HWEP].ep_mps;
        }

        usbd_ep_xfer(ep, s_sUDC.ep[HWEP].xfer_buf, data_len);
    }
    else //CEP
    {
        if (data)
        {
            if (data_len > 0)
            {
                usbd_ep_xfer(ep, (uint8_t *)data, data_len);
                HSUSBD_START_CEP_IN(data_len);
            }
            else
            {
                /* Zero length */
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_ZEROLEN);
            }
        }
        else if (data_len == 0)
        {
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
        }
    }

    return 0;
}

int usbd_ep_start_read(uint8_t busid, const uint8_t ep, uint8_t *data, uint32_t data_len)
{
    uint8_t SWEP = USB_EP_GET_IDX(ep);
    uint8_t HWEP = EPADR_SW2HW(SWEP);

    USB_LOG_DBG("[R] ep:%02x, %p, len: %d\n", ep, data, data_len);

    if (SWEP)  // OUT EPs
    {
        if (!s_sUDC.ep[HWEP].ep_enable)
        {
            return -2;
        }

        s_sUDC.ep[HWEP].xfer_buf = (uint8_t *)data;
        s_sUDC.ep[HWEP].xfer_len = data_len;
        s_sUDC.ep[HWEP].actual_xfer_len = 0;

        if (s_sUDC.ep[HWEP].xfer_len < s_sUDC.ep[HWEP].ep_mps)
        {
            s_sUDC.ep[HWEP].mps_xfer_len = s_sUDC.ep[HWEP].xfer_len;
        }
        else
        {
            s_sUDC.ep[HWEP].mps_xfer_len = s_sUDC.ep[HWEP].ep_mps;
        }
    }
    else //CEP
    {
        if (data_len)
        {
            usbd_ep_xfer(ep, data, data_len);
        }
        else
        {
        }
    }

    return 0;
}

static void dump_isr_event(uint32_t idx, const char *Str[], uint32_t u32PoolSize)
{
    if (idx < u32PoolSize)
    {
        if ((szGLOBAL == Str) && (idx >= 2))
        {
            USB_LOG_DBG("[%d]GLOBAL-EP%cIF\r\n", rt_tick_get(), 'A' + idx - 2);
        }
        else
        {
            USB_LOG_DBG("[%d]%s-%s(#%d)\r\n",
                        rt_tick_get(),
                        (Str == szGLOBAL) ? "GLOBAL" : \
                        ((Str == szUSBIF) ? "  USBIF" : "  CEPIF"), \
                        Str[idx],
                        idx);
        }
    }
}

typedef void (*usbif_isr_func)(uint8_t busid);

static void BUS_ISR_SOFIF(uint8_t busid)
{
    /* This bit indicates when a start-of-frame packet has been received */
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_SOFIF_Msk);
}

static void BUS_ISR_RSTIF(uint8_t busid)
{
    /* When set, this bit indicates that either the USB root port reset is end. */

    /* Reset DMA engine */
    HSUSBD_ResetDMA();

