wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/cherryusb/usb_hs_dc.c
    /* Set DMA engine, Flush All EPs Buffer. */
    //int i;
    //for (i = 0; i < HSUSBD_MAX_EP; i++)
    //{
    //    HSUSBD->EP[i].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
    //}

    /* Call CherryUSB reset callback. */
    usbd_event_reset_handler(busid);
    HSUSBD_ENABLE_USB();

    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_RSTIF_Msk);
}

static void BUS_ISR_RESUMEIF(uint8_t busid)
{
    /* Resume Interrupt */
    /* When set, this bit indicates that a device resume has occurred. */

    /* Enable USBIF - RST, SUSPEND interrupts. */
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_RESUMEIF_Msk);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);

    /* Call CherryUSB resume callback. */
    usbd_event_resume_handler(busid);
}

static void BUS_ISR_SUSPENDIF(uint8_t busid)
{
    /* Suspend Request Interrupt */
    /* This bit is set as default and it has to be cleared by writing ????before the USB reset.
       This bit is also set when a USB Suspend request is detected from the host.  */

    /* Enable USBIF - RST, RESUME, SUSPEND interrupts. */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk |
                          HSUSBD_BUSINTEN_RESUMEIEN_Msk);
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_SUSPENDIF_Msk);

    /* Call CherryUSB suspend callback. */
    usbd_event_suspend_handler(busid);
}

static void BUS_ISR_HISPDIF(uint8_t busid)
{
    /* High-speed Settle Interrupt */
    /*
    0 = No valid high-speed reset protocol is detected.
    1 = Valid high-speed reset protocol is over and the device has settled in high-speed.
    */
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_HISPDIF_Msk);
}

static void BUS_ISR_DMADONEIF(uint8_t busid)
{
    /* DMA Completion Interrupt */
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_DMADONEIF_Msk);
}

static void BUS_ISR_PHYCLKVLDIF(uint8_t busid)
{
    /* Usable Clock Interrupt */
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk);
}

static void BUS_ISR_VBUSDETIF(uint8_t busid)
{
    /* VBUS Detection Interrupt */
    /*  0 = No VBUS is plug-in.
        1 = VBUS is plug-in.  */
    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_VBUSDETIF_Msk);

    /* Check cable connect status. */
    if (HSUSBD_IS_ATTACHED())
    {
        /* USB Plug In */
        USB_LOG_INFO("USB Plug In!!\r\n");

        HSUSBD->OPER = HSUSBD_OPER_HISPDEN_Msk;   /* high-speed */
        HSUSBD_CLR_SE0();
        HSUSBD->OPER |= HSUSBD_OPER_HISHSEN_Msk;  /* Start high speed handshake*/

        usbd_event_connect_handler(busid);
    }
    else
    {
        /* USB Un-plug */
        USB_LOG_INFO("USB Un-plug!!\r\n");

        HSUSBD_DISABLE_USB();
        usbd_event_disconnect_handler(busid);
    }
}

static void CEP_ISR_SETUPTKIF(uint8_t busid)
{
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_SETUPTKIF_Msk);

    /*
    Setup Token Interrupt
    0 = Not a Setup token is received.
    1 = A Setup token is received. Writing 1 clears this status bit
    */
}


static void CEP_ISR_SETUPPKIF(uint8_t busid)
{
    /*
    This bit must be cleared (by writing 1) before the next setup packet can be received. If the bit is not cleared, then the successive setup packets will be overwritten in the setup packet buffer.
    0 = Not a Setup packet has been received from the host.
    1 = A Setup packet has been received from the host.
    */
    s_sUDC.setup_pkt.bmRequestType  = (uint8_t)(HSUSBD->SETUP1_0);
    s_sUDC.setup_pkt.bRequest       = (uint8_t)(HSUSBD->SETUP1_0 >> 8);
    s_sUDC.setup_pkt.wValue         = (uint16_t)(HSUSBD->SETUP3_2);
    s_sUDC.setup_pkt.wIndex         = (uint16_t)(HSUSBD->SETUP5_4);
    s_sUDC.setup_pkt.wLength        = (uint16_t)(HSUSBD->SETUP7_6);

    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_SETUPPKIF_Msk);

    usbd_event_ep0_setup_complete_handler(busid, (uint8_t *)&s_sUDC.setup_pkt);
}

static void CEP_ISR_OUTTKIF(uint8_t busid)
{
    /*
    0 = The control-endpoint does not receive an OUT token from the host.
    1 = The control-endpoint receives an OUT token from the host.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_OUTTKIF_Msk);
}

static void CEP_ISR_INTKIF(uint8_t busid)
{
    /*
    0 = The control-endpoint does not receive an IN token from the host.
    1 = The control-endpoint receives an IN token from the host.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
}

static void CEP_ISR_PINGIF(uint8_t busid)
{
    /*
    0 = The control-endpoint does not receive a ping token from the host.
    1 = The control-endpoint receives a ping token from the host.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_PINGIF_Msk);
}

static void CEP_ISR_TXPKIF(uint8_t busid)
{
    /*
    Data Packet Transmitted Interrupt
    0 = Not a data packet is successfully transmitted to the host in response to an IN-token and an ACK-token is received for the same.
    1 = A data packet is successfully transmitted to the host in response to an IN-token and an ACK-token is received for the same.
    */
    HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);

    usbd_event_ep_in_complete_handler(busid, USB_CONTROL_IN_EP0, HSUSBD->CEPTXCNT);

    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_TXPKIF_Msk);
}

static void CEP_ISR_RXPKIF(uint8_t busid)
{
    /*
    Data Packet Received Interrupt
    0 = Not a data packet is successfully received from the host for an OUT-token and an ACK is sent to the host.
    1 = A data packet is successfully received from the host for an OUT-token and an ACK is sent to the host.
    */
    //HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);

    usbd_event_ep_out_complete_handler(busid, USB_CONTROL_OUT_EP0, HSUSBD->CEPRXCNT);

    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_RXPKIF_Msk);
}

static void CEP_ISR_NAKIF(uint8_t busid)
{
    /*
    NAK Sent Interrupt
    0 = Not a NAK-token is sent in response to an IN/OUT token.
    1 = A NAK-token is sent in response to an IN/OUT token.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_NAKIF_Msk);
}

static void CEP_ISR_STALLIF(uint8_t busid)
{
    /*
    Stall Sent Interrupt
    0 = Not a stall-token is sent in response to an IN/OUT token.
    1 = A stall-token is sent in response to an IN/OUT token.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STALLIF_Msk);
}

static void CEP_ISR_ERRIF(uint8_t busid)
{
    /*
    USB Error Interrupt
    0 = No error had occurred during the transaction.
    1 = An error had occurred during the transaction.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_ERRIF_Msk);
}

static void CEP_ISR_STSDONEIF(uint8_t busid)
{
    if ((g_address > 0) && (HSUSBD_GET_ADDR() == 0))
    {
        HSUSBD_SET_ADDR(g_address);
    }

