wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/cherryusb/usb_hs_dc.c
    /*
    Status Completion Interrupt
    0 = Not a USB transaction has completed successfully.
    1 = The status stage of a USB transaction has completed successfully.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
}

static void CEP_ISR_BUFFULLIF(uint8_t busid)
{
    /*
    Buffer Full Interrupt
    0 = The control-endpoint buffer is not full.
    1 = The control-endpoint buffer is full.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_BUFFULLIF_Msk);
}

static void CEP_ISR_BUFEMPTYIF(uint8_t busid)
{
    /*
    Buffer Empty Interrupt
    0 = The control-endpoint buffer is not empty.
    1 = The control-endpoint buffer is empty.
    */
    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_BUFEMPTYIF_Msk);
}

static void process_busif(uint8_t busid)
{
    static const usbif_isr_func isr_cb[] =
    {
        BUS_ISR_SOFIF,
        BUS_ISR_RSTIF,
        BUS_ISR_RESUMEIF,
        BUS_ISR_SUSPENDIF,
        BUS_ISR_HISPDIF,
        BUS_ISR_DMADONEIF,
        BUS_ISR_PHYCLKVLDIF,
        NULL,
        BUS_ISR_VBUSDETIF
    };
    __IO rt_uint32_t IrqSt = HSUSBD->BUSINTSTS & HSUSBD->BUSINTEN;
    int i;

    // Find first set.
    while ((i = nu_ctz(IrqSt)) < (sizeof(isr_cb) / sizeof(usbif_isr_func)))
    {
        uint32_t u32BitMask = (1 << i);

        //dump_isr_event(i, szUSBIF, sizeof(szUSBIF) / sizeof(char *));

        if (isr_cb[i] != NULL)
            isr_cb[i](busid);

        IrqSt &= ~u32BitMask;
    }
}

static void process_cepif(uint8_t busid)
{
    static const usbif_isr_func isr_cb[] =
    {
        CEP_ISR_SETUPTKIF,
        CEP_ISR_SETUPPKIF,
        CEP_ISR_OUTTKIF,
        CEP_ISR_INTKIF,
        CEP_ISR_PINGIF,
        CEP_ISR_TXPKIF,
        CEP_ISR_RXPKIF,
        CEP_ISR_NAKIF,
        CEP_ISR_STALLIF,
        CEP_ISR_ERRIF,
        CEP_ISR_STSDONEIF,
        CEP_ISR_BUFFULLIF,
        CEP_ISR_BUFEMPTYIF
    };
    __IO rt_uint32_t IrqSt = HSUSBD->CEPINTSTS & HSUSBD->CEPINTEN;
    int i;

    // Find first set.
    while ((i = nu_ctz(IrqSt)) < (sizeof(isr_cb) / sizeof(usbif_isr_func)))
    {
        uint32_t u32BitMask = (1 << i);

        //dump_isr_event(i, szCEPIF, sizeof(szCEPIF) / sizeof(char *));

        if (isr_cb[i] != NULL)
            isr_cb[i](busid);

        IrqSt &= ~u32BitMask;
    }
}

static void process_epxif(uint8_t busid)
{
    /* Service EP events */
    uint32_t HWEP, u32EpIntSts;

    u32EpIntSts = ((HSUSBD->GINTSTS & HSUSBD->GINTEN) >> HSUSBD_GINTSTS_EPAIF_Pos) & ((1 << HSUSBD_MAX_EP) - 1);
    while ((HWEP = nu_ctz(u32EpIntSts)) < HSUSBD_MAX_EP)
    {
        uint32_t u32BitMask = (1 << HWEP);
        uint8_t SWEP = EPADR_HW2SW(HWEP);

        uint32_t IrqSt = HSUSBD->EP[HWEP].EPINTSTS & HSUSBD->EP[HWEP].EPINTEN;
        HSUSBD_CLR_EP_INT_FLAG(HWEP, IrqSt);

        if (HSUSBD_GetEpDir(HWEP) == HSUSBD_EP_CFG_DIR_IN)  // IN ep
        {
            if (s_sUDC.ep[HWEP].xfer_len > s_sUDC.ep[HWEP].ep_mps)
            {
                s_sUDC.ep[HWEP].xfer_buf += s_sUDC.ep[HWEP].ep_mps;
                s_sUDC.ep[HWEP].xfer_len -= s_sUDC.ep[HWEP].ep_mps;
                s_sUDC.ep[HWEP].actual_xfer_len += s_sUDC.ep[HWEP].ep_mps;

                uint16_t min_len = MIN(s_sUDC.ep[HWEP].xfer_len, s_sUDC.ep[HWEP].ep_mps);

                usbd_ep_xfer(s_sUDC.ep[HWEP].ep_addr, s_sUDC.ep[HWEP].xfer_buf, min_len);

            }
            else
            {
                s_sUDC.ep[HWEP].actual_xfer_len += s_sUDC.ep[HWEP].xfer_len;
                s_sUDC.ep[HWEP].xfer_len = 0;

                usbd_event_ep_in_complete_handler(busid, SWEP | 0x80, s_sUDC.ep[HWEP].actual_xfer_len);
            }
        }
        else // OUT
        {
            uint32_t u32Len = HSUSBD->EP[HWEP].EPDATCNT & 0xFFFFUL;

            usbd_ep_xfer(s_sUDC.ep[HWEP].ep_addr, s_sUDC.ep[HWEP].xfer_buf, u32Len);

            s_sUDC.ep[HWEP].xfer_buf += u32Len;
            s_sUDC.ep[HWEP].xfer_len -= u32Len;
            s_sUDC.ep[HWEP].actual_xfer_len += u32Len;

            if ((u32Len < s_sUDC.ep[HWEP].ep_mps) ||
                    (s_sUDC.ep[HWEP].xfer_len == 0))
            {
                usbd_event_ep_out_complete_handler(busid, SWEP, s_sUDC.ep[HWEP].actual_xfer_len);
            }
            else
            {
                if (s_sUDC.ep[HWEP].xfer_len < s_sUDC.ep[HWEP].ep_mps)
                {
                    s_sUDC.ep[HWEP].mps_xfer_len = s_sUDC.ep[HWEP].xfer_len;
                }
                else
                {
                    s_sUDC.ep[HWEP].mps_xfer_len = s_sUDC.ep[HWEP].ep_mps;
                }
            }
        }


        u32EpIntSts &= ~u32BitMask;
    }

} //paser_irq_eps(uint8_t busid)

void CherryUSB_USBD_IRQHandler(uint8_t busid)
{
    __IO rt_uint32_t IrqSt = HSUSBD->GINTSTS & HSUSBD->GINTEN;
    if (IrqSt)
    {
        int i;

        // Find first set.
        while ((i = nu_ctz(IrqSt)) != 32)
        {
            uint32_t u32BitMask = (1 << i);

            //dump_isr_event(i, szGLOBAL, 2 + HSUSBD_MAX_EP);

            switch (u32BitMask)
            {
            case HSUSBD_GINTSTS_USBIF_Msk:
                process_busif(busid);
                break;

            case HSUSBD_GINTSTS_CEPIF_Msk:
                process_cepif(busid);
                break;

            default: /* EP interrups */
                process_epxif(busid);
                break;
            }

            IrqSt &= ~u32BitMask;
        }
    }
}

